name: "postprocessing"
backend: "python"
max_batch_size: 4
input [
  {
    name: "TOKENS_BATCH"
    data_type: TYPE_UINT32
    dims: [ -1, -1 ]
  },
  {
    name: "RESPONSE_INPUT_LENGTHS"
    data_type: TYPE_INT32
    dims: [ -1 ]
  }
]
output [
  {
    name: "OUTPUT"
    data_type: TYPE_STRING
    dims: [ -1, -1 ]
  }
]

instance_group [
    {
        count: 1
        kind: KIND_CPU
    }
]

parameters {
  key: "tokenizer_path"
  value: {
    string_value: "/export/triton-model-store/bloom_1b1/postprocessing/1/bloom_tokenizer/"
  }
}